"""
《邢不行-2019新版|Python股票量化投资课程》
author: 邢不行/西蒙斯
微信: xingbuxing0807

# 本节课程内容
- 注释的含义和用法
- print函数介绍
- 代码运行顺序
- exit()函数介绍
- python中的中文
- 换行
- 空格
希望以后大家只要看这个程序，就能回想起相关的知识。
"""

# === 注释的写法
"""
多行注释的写法
"""
# 单行注释的写法，在每一行的开头，加上#，是对该行进行单行注释，井号后的语句不会被执行
# print('hello money')  # 行末注释，在一句程序的末尾，一般用来解释这句话。注意空格。

# --- 注释的快捷键
# control + / 多行同时注释或取消注释（mac上是command + /）。
# 尝试同时取消注释或注释下面三行代码
# print(1)
# print(2)
# print(3)


# === 代码执行的顺序
# print(3)
# print(1)
# print(2)


# === exit
# print(1)
# exit()  # 这样就退出执行了
# print(2)


# === python中的中文
# print（1） # 这里的括号是中文的


# === python中的换行
# print(1)
#
# print(2)
# print(3)print(4)  # 会有红色波浪线


# === python中的空格
print(     '邢不行')  # 只会有一个黄色的警告，并不会影响执行
